#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
volterra_api_credential.api: Refreshing state... [id=juice-api-token-rsqnxtjy]
volterra_app_firewall.recommended: Refreshing state... [id=8c7d2afc-27bf-46dd-aab8-ad6a03f8ad8b]
volterra_origin_pool.origin: Refreshing state... [id=0e298bca-600c-4bc1-bc91-360d5509c886]
data.http.volterra_get_blocked_by_waf: Reading...
data.http.volterra_get_blocked_by_waf: Read complete after 0s [id=https://f5-emea-ent.console.ves.volterra.io/api/data/namespaces/s-archer/app_security/events]
data.jq_query.json_parser: Reading...
data.jq_query.json_parser: Read complete after 0s [id=1748467798]
local_file.waf_exclusion_rules_defined_within_interval: Refreshing state... [id=402759bd3457ed39aacc448f18317c5d59b0ad88]
volterra_http_loadbalancer.lb: Refreshing state... [id=93dba57a-2c4f-4c09-8831-6181170a8ea2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.waf_exclusion_rules_defined_within_interval must be replaced
-/+ resource "local_file" "waf_exclusion_rules_defined_within_interval" {
      ~ content              = "waf_exclusion_rules = []" -> "waf_exclusion_rules = [{\"context\":\"parameter (a or 1=1; select * from mysql.user)\",\"host\":\"juiceshop-waf.volt.archf5.com\",\"method\":\"GET\",\"path\":\"/rest/products/1/reviews\",\"signature_id\":\"200002053\"},{\"context\":\"url\",\"host\":\"juiceshop-waf.volt.archf5.com\",\"method\":\"GET\",\"path\":\"/etc/passwd\",\"signature_id\":\"200010468\"}]" # forces replacement
      ~ content_base64sha256 = "fCC2fisnTZe0J5eOVc1lZ2raBa865kKyv1U727KZdi0=" -> (known after apply)
      ~ content_base64sha512 = "TdceC+qRKCD/9lGHDm19aquaq0t9JD9E/gRVho+ek2tobLxnAaPa0iz5LidRVAetCdgSaIVhSuz5cMdeK8XATg==" -> (known after apply)
      ~ content_md5          = "2c044fd36b3a2cf4af0b60dbcb4012aa" -> (known after apply)
      ~ content_sha1         = "402759bd3457ed39aacc448f18317c5d59b0ad88" -> (known after apply)
      ~ content_sha256       = "7c20b67e2b274d97b427978e55cd65676ada05af3ae642b2bf553bdbb299762d" -> (known after apply)
      ~ content_sha512       = "4dd71e0bea912820fff651870e6d7d6aab9aab4b7d243f44fe0455868f9e936b686cbc6701a3dad22cf92e27515407ad09d8126885614aecf970c75e2bc5c04e" -> (known after apply)
      ~ id                   = "402759bd3457ed39aacc448f18317c5d59b0ad88" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # volterra_http_loadbalancer.lb will be updated in-place
  ~ resource "volterra_http_loadbalancer" "lb" {
      - default_sensitive_data_policy    = true -> null
      - disable_api_definition           = true -> null
      - disable_api_discovery            = true -> null
      - disable_malicious_user_detection = true -> null
      - disable_malware_protection       = true -> null
      - disable_threat_mesh              = true -> null
      - disable_trust_client_ip_headers  = true -> null
      ~ disable_waf                      = false -> true
        id                               = "93dba57a-2c4f-4c09-8831-6181170a8ea2"
      - l7_ddos_action_default           = true -> null
        name                             = "juice-git-act-tf"
        # (27 unchanged attributes hidden)

      ~ app_firewall {
            name      = "juice-git-act-tf"
          - tenant    = "f5-emea-ent-bceuutam" -> null
            # (1 unchanged attribute hidden)
        }

      ~ default_route_pools {
            # (3 unchanged attributes hidden)

          ~ pool {
                name      = "juice-git-act-tf"
              - tenant    = "f5-emea-ent-bceuutam" -> null
                # (1 unchanged attribute hidden)
            }
        }


      + waf_exclusion_rules {
          + exact_value = "juiceshop-waf.volt.archf5.com"
          + methods     = [
              + "GET",
            ]
          + path_regex  = "/rest/products/1/reviews"

          + app_firewall_detection_control {

              + exclude_signature_contexts {
                  + context      = "CONTEXT_ANY"
                  + signature_id = 200002053
                }
            }

          + metadata {
              + name = (known after apply)
            }
        }
      + waf_exclusion_rules {
          + exact_value = "juiceshop-waf.volt.archf5.com"
          + methods     = [
              + "GET",
            ]
          + path_regex  = "/etc/passwd"

          + app_firewall_detection_control {

              + exclude_signature_contexts {
                  + context      = "CONTEXT_ANY"
                  + signature_id = 200010468
                }
            }

          + metadata {
              + name = (known after apply)
            }
        }
        # (1 unchanged block hidden)
    }

  # volterra_origin_pool.origin will be updated in-place
  ~ resource "volterra_origin_pool" "origin" {
        id                     = "0e298bca-600c-4bc1-bc91-360d5509c886"
        name                   = "juice-git-act-tf"
        # (13 unchanged attributes hidden)


      ~ use_tls {
          - default_session_key_caching = true -> null
            # (7 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ jquery     = jsonencode(
      ~ null -> [
          + {
              + context      = "parameter (a or 1=1; select * from mysql.user)"
              + host         = "juiceshop-waf.volt.archf5.com"
              + method       = "GET"
              + path         = "/rest/products/1/reviews"
              + signature_id = "200002053"
            },
          + {
              + context      = "url"
              + host         = "juiceshop-waf.volt.archf5.com"
              + method       = "GET"
              + path         = "/etc/passwd"
              + signature_id = "200010468"
            },
        ]
    )
  ~ timestamps = <<-EOT
      - timestamp_start: 1748466853, timestamp_end: 1748466924, request body:{"aggs":{},"end_time":"1748466924","limit":0,"namespace":"s-archer","query":"{action=\"block\", authority=\"juiceshop-waf.volt.archf5.com\",sec_event_type=\"waf_sec_event\"}","scroll":false,"sort":"DESCENDING","start_time":"1748466853"}, response body:{
      + timestamp_start: 1748467708, timestamp_end: 1748467778, request body:{"aggs":{},"end_time":"1748467778","limit":0,"namespace":"s-archer","query":"{action=\"block\", authority=\"juiceshop-waf.volt.archf5.com\",sec_event_type=\"waf_sec_event\"}","scroll":false,"sort":"DESCENDING","start_time":"1748467708"}, response body:{
          "events": [
      +     "{\"country\":\"US\",\"browser_type\":\"Chrome\",\"device_type\":\"Mac\",\"signatures\":[{\"attack_type\":\"ATTACK_TYPE_PREDICTABLE_RESOURCE_LOCATION\",\"context\":\"url\",\"name\":\"\\\"/etc/passwd\\\" access (URI)\",\"accuracy\":\"medium_accuracy\",\"risk\":\"High\",\"id\":\"200010468\",\"state\":\"Enabled\"}],\"req_headers_size\":3766,\"req_id\":\"32267702-45bc-42fa-af45-d898c4d54d95\",\"enforcement_mode\":\"Blocking\",\"hostname\":\"master-3\",\"app_firewall_name\":\"juice-git-act-tf\",\"src_instance\":\"US\",\"host\":\"10.62.51.13\",\"req_headers\":\"{\\\"Accept\\\":\\\"application/json, text/plain, */*\\\",\\\"Accept-Encoding\\\":\\\"deflate, gzip, br, zstd\\\",\\\"Accept-Language\\\":\\\"en-GB,en-US;q=0.9,en;q=0.8\\\",\\\"Authority\\\":\\\"juiceshop-waf.volt.archf5.com\\\",\\\"Authorization\\\":\\\"*******************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************\\\",\\\"Cache-Control\\\":\\\"no-cache\\\",\\\"Cookie\\\":\\\"language=en; _imp_apg_r_=%7B%22diA%22%3A%22AeU%2F2GIAAAAAMkvN%2Bin9mmRwh3Hk9mVm%22%2C%22diB%22%3A%22Afe7mHagwHuSTDi9y4lqSPM1dWLspxkS%22%7D; _imp_di_pc_=AeU%2F2GIAAAAAMkvN%2Bin9mmRwh3Hk9mVm; 471d5=1658339312730-986149438; 471d03=QnP8f6VRKgWnJ3j8X6Wg0qCTnC5e6xE77WXVAS9eaPxRQCLTLA5B6gPeomumfKrRAWEz9cuokiWv3gpPoK+uQl8Jn9I80MCgfOdJjIMzYiA8TPTy1JnUdReKuiL+I1fXCRCMeWcwqIbQWY80xP7UzeEJRaxKbjc6DVfJ1ktfkk3dMPR1; 471d1=78265d438c65999f8ecf40e794f67c450000d9938b6181be93d2; ea0a5=1658383579469-861820129; ea0a1=411861d7529cbd920e1deb2c24378eb60000d4e3c2aa286845f1; ea0a03=RpGjXpD6iXnlY8Fxa09WI5OpHEtRpz5gLGKyjrZbYT1uwH+RJjueT8mYRzPx4swy8duo+qvlZOXnGFVD8DBuNz7+SiTFOdtfsusoQDXLBChVD3h3j5OX3gxqUlQDxTFzR65FDFL97d7ujovYrkWRk9RjxHs80QY7V4BxNsnx5xXTuAKy; TS01dc4fc6=014c8ff5015f3c82fd12eed38cfeb58938b56c0cfe1f52722b7defb04817abd30c24032a483a6e93747ec9fc4a8dde6399d4f5f52c; welcomebanner_status=dismiss; f2525=1658389746506-674591810; cookieconsent_status=dismiss; token=eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiJ9.eyJzdGF0dXMiOiJzdWNjZXNzIiwiZGF0YSI6eyJpZCI6MjEsInVzZXJuYW1lIjoiIiwiZW1haWwiOiJxd2VAcXdlLnF3ZSIsInBhc3N3b3JkIjoiYTcwNDVjMGNjZDVkMzAzNTNiYzYxNDgxOTVkODM2YjMiLCJyb2xlIjoiY3VzdG9tZXIiLCJkZWx1eGVUb2tlbiI6IiIsImxhc3RMb2dpbklwIjoiMC4wLjAuMCIsInByb2ZpbGVJbWFnZSI6Ii9hc3NldHMvcHVibGljL2ltYWdlcy91cGxvYWRzL2RlZmF1bHQuc3ZnIiwidG90cFNlY3JldCI6IiIsImlzQWN0aXZlIjp0cnVlLCJjcmVhdGVkQXQiOiIyMDIyLTA3LTIxIDA3OjUwOjE5LjUyMCArMDA6MDAiLCJ1cGRhdGVkQXQiOiIyMDIyLTA3LTIxIDA3OjUwOjE5LjUyMCArMDA6MDAiLCJkZWxldGVkQXQiOm51bGx9LCJpYXQiOjE2NTgzODk4MjgsImV4cCI6MTY1ODQwNzgyOH0.dz93ieZB5OQQ-Dyxz9DFjy34KMTapTvJu6TmZGgbh-7lWQRx3egBbX0wW32-yymo6QamMZKDRC_uzkfXcHJWsiUX6CEgP3O8w4OMq-ETYL5uuv0mwL6BLMDScotPFlzStJOHOMKLWoGNiytOmaus8mMdI-tf1qsQosFhD35M00o; 01bc03=wIG2A2Ygbqs9s80EVIRO1xw9uVQPWV1iv7Qzvg2NdKuIGnavdT+um+iiQD/lm+Ko7u+bTYGqn0RVQoptOohmPiGKdbTz5aiWybhUZNxIQjTAOkbzBmorP0dtXrrh4WB+ZB8hN/XNQzWxP5AuRgYIHh+1snOXr1zXvuJJySPFztNHnDEq; f25203=ITRanDO1i9Xd6CPj62n3vQzsSgt1EehgUf48CJ1P3BEkxfO5klXPvtaYa3qWCEeJWFQ1RMnGywlBb1Wt9FEeV4hyF5BD6tYnN0nY1FGMMy9LT1rlPDA8qUpDx5X0R42oSlyTxSLe1MPptSXzTSgQh7QEqJygxi7MwLs0H9zsW1+OVhmh; 01bc1=337bff4da4ba7b9e13eed15bc4536af90000fe6441d1dc08ee96; f2521=337bff4da4ba7b9e13eed15bc4536af900005fc6d518de78de37\\\",\\\"Host\\\":\\\"juiceshop-waf.volt.archf5.com\\\",\\\"Method\\\":\\\"GET\\\",\\\"Pragma\\\":\\\"no-cache\\\",\\\"Referer\\\":\\\"https://juiceshop-waf.volt.archf5.com/\\\",\\\"Scheme\\\":\\\"https\\\",\\\"Sec-Ch-Ua\\\":\\\"\\\\\\\".Not/A)Brand\\\\\\\";v=\\\\\\\"99\\\\\\\", \\\\\\\"Google Chrome\\\\\\\";v=\\\\\\\"103\\\\\\\", \\\\\\\"Chromium\\\\\\\";v=\\\\\\\"103\\\\\\\"\\\",\\\"Sec-Ch-Ua-Mobile\\\":\\\"?0\\\",\\\"Sec-Ch-Ua-Platform\\\":\\\"\\\\\\\"macOS\\\\\\\"\\\",\\\"Sec-Fetch-Dest\\\":\\\"empty\\\",\\\"Sec-Fetch-Mode\\\":\\\"cors\\\",\\\"Sec-Fetch-Site\\\":\\\"same-origin\\\",\\\"User-Agent\\\":\\\"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36\\\",\\\"X-Envoy-External-Address\\\":\\\"20.169.14.39\\\",\\\"X-F5-Request-Id\\\":\\\"32267702-45bc-42fa-af45-d898c4d54d95\\\",\\\"X-Forwarded-For\\\":\\\"20.169.14.39\\\",\\\"X-Forwarded-Proto\\\":\\\"https\\\",\\\"X-Request-Id\\\":\\\"32267702-45bc-42fa-af45-d898c4d54d95\\\"}\",\"action\":\"block\",\"vhost_id\":\"c3b7cb31-bad2-468e-ab13-28cd94f0c35d\",\"tenant\":\"f5-emea-ent-bceuutam\",\"longitude\":\"-112.000000\",\"app\":\"obelix\",\"method\":\"GET\",\"as_number\":\"8075\",\"http_version\":\"HTTP/1.1\",\"x_forwarded_for\":\"20.169.14.39\",\"rsp_size\":\"0\",\"api_endpoint\":\"UNKNOWN\",\"sec_event_name\":\"WAF\",\"authority\":\"juiceshop-waf.volt.archf5.com\",\"domain\":\"juiceshop-waf.volt.archf5.com\",\"region\":\"US-AZ\",\"rsp_code_class\":\"2xx\",\"waf_mode\":\"block\",\"city\":\"Phoenix\",\"recommended_action\":\"block\",\"latitude\":\"33.619999\",\"messageid\":\"c102667e-dea5-4551-b495-71bf4217a9f6\",\"dst_ip\":\"72.19.3.187\",\"network\":\"20.169.0.0\",\"src_site\":\"sv10-sjc\",\"as_org\":\"microsoft corporation\",\"src_ip\":\"20.169.14.39\",\"stream\":\"svcfw\",\"violation_rating\":\"4\",\"original_path\":\"/etc/passwd\",\"message_key\":\"6052495073980027651\",\"req_size\":\"3766\",\"user_agent\":\"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36\",\"cluster_name\":\"sv10-sjc-int-ves-io\",\"tls_fingerprint\":\"0149f47eabf9a20d0893e2a44e5a6323\",\"src\":\"N:public\",\"rsp_code\":\"200\",\"attack_types\":[{\"name\":\"ATTACK_TYPE_PREDICTABLE_RESOURCE_LOCATION\"}],\"sni\":\"juiceshop-waf.volt.archf5.com\",\"src_port\":\"34881\",\"site\":\"sv10-sjc\",\"@timestamp\":\"2025-05-28T21:28:33.843Z\",\"dst_port\":\"0\",\"namespace\":\"s-archer\",\"req_path\":\"/etc/passwd\",\"time\":\"2025-05-28T21:28:33.843Z\",\"asn\":\"microsoft corporation(8075)\",\"sec_event_type\":\"waf_sec_event\",\"user\":\"IP-20.169.14.39\",\"vh_name\":\"ves-io-http-loadbalancer-juice-git-act-tf\"}",
      +     "{\"country\":\"US\",\"browser_type\":\"Chrome\",\"device_type\":\"Mac\",\"signatures\":[{\"attack_type\":\"ATTACK_TYPE_SQL_INJECTION\",\"matching_info\":\"Matched 10 characters on offset 24 against value: 'a or 1=1; select * from mysql.user='. \",\"context\":\"parameter (a or 1=1; select * from mysql.user)\",\"name\":\"SQL-INJ mysql.user\",\"accuracy\":\"medium_accuracy\",\"risk\":\"High\",\"id\":\"200002053\",\"state\":\"Enabled\"}],\"req_headers_size\":3766,\"req_id\":\"671558c6-e85c-491b-903b-b306116a63d1\",\"enforcement_mode\":\"Blocking\",\"hostname\":\"master-9\",\"app_firewall_name\":\"juice-git-act-tf\",\"src_instance\":\"US\",\"host\":\"10.62.51.19\",\"req_headers\":\"{\\\"Accept\\\":\\\"application/json, text/plain, */*\\\",\\\"Accept-Encoding\\\":\\\"deflate, gzip, br, zstd\\\",\\\"Accept-Language\\\":\\\"en-GB,en-US;q=0.9,en;q=0.8\\\",\\\"Authority\\\":\\\"juiceshop-waf.volt.archf5.com\\\",\\\"Authorization\\\":\\\"*******************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************************\\\",\\\"Cache-Control\\\":\\\"no-cache\\\",\\\"Cookie\\\":\\\"language=en; _imp_apg_r_=%7B%22diA%22%3A%22AeU%2F2GIAAAAAMkvN%2Bin9mmRwh3Hk9mVm%22%2C%22diB%22%3A%22Afe7mHagwHuSTDi9y4lqSPM1dWLspxkS%22%7D; _imp_di_pc_=AeU%2F2GIAAAAAMkvN%2Bin9mmRwh3Hk9mVm; 471d5=1658339312730-986149438; 471d03=QnP8f6VRKgWnJ3j8X6Wg0qCTnC5e6xE77WXVAS9eaPxRQCLTLA5B6gPeomumfKrRAWEz9cuokiWv3gpPoK+uQl8Jn9I80MCgfOdJjIMzYiA8TPTy1JnUdReKuiL+I1fXCRCMeWcwqIbQWY80xP7UzeEJRaxKbjc6DVfJ1ktfkk3dMPR1; 471d1=78265d438c65999f8ecf40e794f67c450000d9938b6181be93d2; ea0a5=1658383579469-861820129; ea0a1=411861d7529cbd920e1deb2c24378eb60000d4e3c2aa286845f1; ea0a03=RpGjXpD6iXnlY8Fxa09WI5OpHEtRpz5gLGKyjrZbYT1uwH+RJjueT8mYRzPx4swy8duo+qvlZOXnGFVD8DBuNz7+SiTFOdtfsusoQDXLBChVD3h3j5OX3gxqUlQDxTFzR65FDFL97d7ujovYrkWRk9RjxHs80QY7V4BxNsnx5xXTuAKy; TS01dc4fc6=014c8ff5015f3c82fd12eed38cfeb58938b56c0cfe1f52722b7defb04817abd30c24032a483a6e93747ec9fc4a8dde6399d4f5f52c; welcomebanner_status=dismiss; f2525=1658389746506-674591810; cookieconsent_status=dismiss; token=eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiJ9.eyJzdGF0dXMiOiJzdWNjZXNzIiwiZGF0YSI6eyJpZCI6MjEsInVzZXJuYW1lIjoiIiwiZW1haWwiOiJxd2VAcXdlLnF3ZSIsInBhc3N3b3JkIjoiYTcwNDVjMGNjZDVkMzAzNTNiYzYxNDgxOTVkODM2YjMiLCJyb2xlIjoiY3VzdG9tZXIiLCJkZWx1eGVUb2tlbiI6IiIsImxhc3RMb2dpbklwIjoiMC4wLjAuMCIsInByb2ZpbGVJbWFnZSI6Ii9hc3NldHMvcHVibGljL2ltYWdlcy91cGxvYWRzL2RlZmF1bHQuc3ZnIiwidG90cFNlY3JldCI6IiIsImlzQWN0aXZlIjp0cnVlLCJjcmVhdGVkQXQiOiIyMDIyLTA3LTIxIDA3OjUwOjE5LjUyMCArMDA6MDAiLCJ1cGRhdGVkQXQiOiIyMDIyLTA3LTIxIDA3OjUwOjE5LjUyMCArMDA6MDAiLCJkZWxldGVkQXQiOm51bGx9LCJpYXQiOjE2NTgzODk4MjgsImV4cCI6MTY1ODQwNzgyOH0.dz93ieZB5OQQ-Dyxz9DFjy34KMTapTvJu6TmZGgbh-7lWQRx3egBbX0wW32-yymo6QamMZKDRC_uzkfXcHJWsiUX6CEgP3O8w4OMq-ETYL5uuv0mwL6BLMDScotPFlzStJOHOMKLWoGNiytOmaus8mMdI-tf1qsQosFhD35M00o; 01bc03=wIG2A2Ygbqs9s80EVIRO1xw9uVQPWV1iv7Qzvg2NdKuIGnavdT+um+iiQD/lm+Ko7u+bTYGqn0RVQoptOohmPiGKdbTz5aiWybhUZNxIQjTAOkbzBmorP0dtXrrh4WB+ZB8hN/XNQzWxP5AuRgYIHh+1snOXr1zXvuJJySPFztNHnDEq; f25203=ITRanDO1i9Xd6CPj62n3vQzsSgt1EehgUf48CJ1P3BEkxfO5klXPvtaYa3qWCEeJWFQ1RMnGywlBb1Wt9FEeV4hyF5BD6tYnN0nY1FGMMy9LT1rlPDA8qUpDx5X0R42oSlyTxSLe1MPptSXzTSgQh7QEqJygxi7MwLs0H9zsW1+OVhmh; 01bc1=337bff4da4ba7b9e13eed15bc4536af90000fe6441d1dc08ee96; f2521=337bff4da4ba7b9e13eed15bc4536af900005fc6d518de78de37\\\",\\\"Host\\\":\\\"juiceshop-waf.volt.archf5.com\\\",\\\"Method\\\":\\\"GET\\\",\\\"Pragma\\\":\\\"no-cache\\\",\\\"Referer\\\":\\\"https://juiceshop-waf.volt.archf5.com/\\\",\\\"Scheme\\\":\\\"https\\\",\\\"Sec-Ch-Ua\\\":\\\"\\\\\\\".Not/A)Brand\\\\\\\";v=\\\\\\\"99\\\\\\\", \\\\\\\"Google Chrome\\\\\\\";v=\\\\\\\"103\\\\\\\", \\\\\\\"Chromium\\\\\\\";v=\\\\\\\"103\\\\\\\"\\\",\\\"Sec-Ch-Ua-Mobile\\\":\\\"?0\\\",\\\"Sec-Ch-Ua-Platform\\\":\\\"\\\\\\\"macOS\\\\\\\"\\\",\\\"Sec-Fetch-Dest\\\":\\\"empty\\\",\\\"Sec-Fetch-Mode\\\":\\\"cors\\\",\\\"Sec-Fetch-Site\\\":\\\"same-origin\\\",\\\"User-Agent\\\":\\\"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36\\\",\\\"X-Envoy-External-Address\\\":\\\"20.169.14.39\\\",\\\"X-F5-Request-Id\\\":\\\"671558c6-e85c-491b-903b-b306116a63d1\\\",\\\"X-Forwarded-For\\\":\\\"20.169.14.39\\\",\\\"X-Forwarded-Proto\\\":\\\"https\\\",\\\"X-Request-Id\\\":\\\"671558c6-e85c-491b-903b-b306116a63d1\\\"}\",\"action\":\"block\",\"vhost_id\":\"c3b7cb31-bad2-468e-ab13-28cd94f0c35d\",\"tenant\":\"f5-emea-ent-bceuutam\",\"longitude\":\"-112.000000\",\"app\":\"obelix\",\"method\":\"GET\",\"as_number\":\"8075\",\"http_version\":\"HTTP/1.1\",\"x_forwarded_for\":\"20.169.14.39\",\"rsp_size\":\"0\",\"api_endpoint\":\"UNKNOWN\",\"sec_event_name\":\"WAF\",\"authority\":\"juiceshop-waf.volt.archf5.com\",\"domain\":\"juiceshop-waf.volt.archf5.com\",\"region\":\"US-AZ\",\"rsp_code_class\":\"2xx\",\"waf_mode\":\"block\",\"city\":\"Phoenix\",\"recommended_action\":\"block\",\"latitude\":\"33.619999\",\"messageid\":\"c102667e-dea5-4551-b495-71bf4217a9f6\",\"dst_ip\":\"72.19.3.187\",\"network\":\"20.169.0.0\",\"src_site\":\"sv10-sjc\",\"as_org\":\"microsoft corporation\",\"src_ip\":\"20.169.14.39\",\"stream\":\"svcfw\",\"violation_rating\":\"5\",\"original_path\":\"/rest/products/1/reviews\",\"message_key\":\"-8506877974815215292\",\"req_size\":\"3766\",\"user_agent\":\"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36\",\"cluster_name\":\"sv10-sjc-int-ves-io\",\"tls_fingerprint\":\"0149f47eabf9a20d0893e2a44e5a6323\",\"src\":\"N:public\",\"rsp_code\":\"200\",\"attack_types\":[{\"name\":\"ATTACK_TYPE_SQL_INJECTION\"}],\"sni\":\"juiceshop-waf.volt.archf5.com\",\"src_port\":\"34880\",\"site\":\"sv10-sjc\",\"@timestamp\":\"2025-05-28T21:28:33.473Z\",\"req_params\":\"a%20or%201%3D1%3B%20select%20%2A%20from%20mysql.user\",\"dst_port\":\"0\",\"namespace\":\"s-archer\",\"req_path\":\"/rest/products/1/reviews\",\"time\":\"2025-05-28T21:28:33.473Z\",\"asn\":\"microsoft corporation(8075)\",\"sec_event_type\":\"waf_sec_event\",\"user\":\"IP-20.169.14.39\",\"vh_name\":\"ves-io-http-loadbalancer-juice-git-act-tf\"}"
          ],
      -   "total_hits": "0",
      +   "total_hits": "2",
          "aggs": {
          },
          "scroll_id": ""
        } 
    EOT

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @s-archer, Action: `pull_request`*